In [ ]:
四、数据分析---烹调出炉
4.1 数据运算---开始烹调
4.2 时间序列---炒菜计时器
4.3 数据分组---菜品分类
4.4 多表拼接---水果拼盘
4.5 结果导出---盛菜转盘

# 4.1 数据运算

## 4.1.1 算术运算

In [ ]:
算术运算指对指定数值元素进行加、减、乘、除；
excel中任意两列的算术运算比较简单；
mysql中select A, B, A-B as C from 表1；
python中也是类似，df['col1']+-*/df['col2']

In [2]:
import pandas as pd
import numpy as np
df4=pd.DataFrame({'a':[1,2,3,4],'b':[4,5,6,7],'c':[7,8,9,10]})
df4

   a  b   c
0  1  4   7
1  2  5   8
2  3  6   9
3  4  7  10

In [3]:
#两列运算
df4['a']+df4['b']

0     5
1     7
2     9
3    11
dtype: int64

In [4]:
#某列与常数运算
df4['a']*2

0    2
1    4
2    6
3    8
Name: a, dtype: int64

## 4.1.2 比较运算

In [ ]:
比较运算指对指定列进行的大于、等于、小于
excel中直接用=B2>C2，返回true/false;
mysql中用select b=c from 表名，返回1/0；
python中也是类似,df['b']>df['c']

In [5]:
df4['b']>df4['c']

0    False
1    False
2    False
3    False
dtype: bool

## 4.1.3 汇总运算

汇总运算指将数据进行汇总返回一个汇总以后的结果值，有计数、求和、均值、最大值、最小值、中位数、众数、方差、标准差、分位数等；

1、计数

excel中用counta()函数来计算某个区域中非空单元格的个数，count()函数来计算某个区域中含有数字的单元格的个数；
mysql中select count(*/列名) from 表名 来计算非空计数；select count(distinct 列名) from 表名 来计算非空非重复值计数；
python中df.count()计算表中每列的非空值的个数；df.count(axis=1)计算表中每行的非空值的个数；df['列名/行名'].count()计算表中某列/某行的非空值的个数；df['列名'].drop_duplicates().count()表示对某列进行去重计数。

In [6]:
df4.count()

a    4
b    4
c    4
dtype: int64

In [7]:
df4.count(axis=1)

0    3
1    3
2    3
3    3
dtype: int64

In [9]:
df4['a'].count()

4

In [42]:
import pandas as pd
import numpy as np
df44=pd.DataFrame({'a':[1,2,2,4],'b':[4,6,6,7],'c':[8,8,9,10]})
df44

   a  b   c
0  1  4   8
1  2  6   8
2  2  6   9
3  4  7  10

In [44]:
df44['a'].drop_duplicates().count()

3

In [45]:
df44.drop_duplicates().count()

a    4
b    4
c    4
dtype: int64

2、求和

excel中用sum(D2:D6)来计算某个区域的和；
mysql中用select sum(列名) from 表名；
python中df.sum()计算表中每列的和；df.sum(axis=1)计算表中每行的和；df['列名/行名'].sum()计算表中某列/某行的和；

In [10]:
df4.sum()

a    10
b    22
c    34
dtype: int64

In [11]:
df4.sum(axis=1)

0    12
1    15
2    18
3    21
dtype: int64

In [12]:
df4['a'].sum()

10

3、均值

excel中用average(D2:D6)来计算某个区域的均值；
mysql中用select AVG(列名) from 表名；
python中df.mean()计算表中每列的均值；df.mean(axis=1)计算表中每行的均值；df['列名/行名'].mean()计算表中某列/某行的均值；

4、最大值

excel中用max(D2:D6)来计算某个区域的最大值；
mysql中用select max(列名) from 表名；
python中df.max()计算表中每列的最大值；df.max(axis=1)计算表中每行的最大值；df['列名/行名'].max()计算表中某列/某行的最大值；

5、最小值

excel中用min(D2:D6)来计算某个区域的最小值；
mysql中用select min(列名) from 表名；
python中df.min()计算表中每列的最小值；df.min(axis=1)计算表中每行的最小值；df['列名/行名'].min()计算表中某列/某行的最小值；

6、中位数

excel中用median(D2:D6)来计算某个区域的中位数；
mysql中没有直接可以使用的函数，可查看https://blog.csdn.net/meaijojo/article/details/8101867
python中df.median()计算表中每列的中位数；df.median(axis=1)计算表中每行的中位数；df['列名/行名'].median()计算表中某列/某行的中位数；

7、众数

excel中用mode(D2:D6)来计算某个区域的众数；
mysql中也没有直接可以使用的函数，可查看https://blog.csdn.net/NextAction/article/details/80421854
python中df.mode()计算表中每列的众数；df.mode(axis=1)计算表中每行的众数；df['列名/行名'].mode()计算表中某列/某行的众数；

8、方差

excel中用var(D2:D6)来计算某个区域的方差；
mysql中用select VARIANCE(列名) from 表名；
python中df.var()计算表中每列的方差；df.var(axis=1)计算表中每行的方差；df['列名/行名'].var()计算表中某列/某行的方差；

9、标准差

excel中用stdevp(D2:D6)来计算某个区域的标准差；
mysql中用select STD(列名) from 表名来求总体标准差；select  STDDEV_SAMP(列名) from 表名来求样本标准差；
python中df.std()计算表中每列的标准差；df.std(axis=1)计算表中每行的标准差；df['列名/行名'].std()计算表中某列/某行的标准差；

10、quantile分位数

分位数是比中位数更加详细的基于位置的指标，分位数主要有1/4、2/4（中位数）、3/4分位数；
excel中percentile(D2:D6,0.25)-1/4分位数，percentile(D2:D6,0.5)-2/4分位数，percentile(D2:D6,0.75)-3/4分位数；
mysql中没有可以直接使用的函数；
python中df.quantile()计算表中每列的分位数；df.quantile(axis=1)计算表中每行的分位数；df['列名/行名'].quantile()计算表中某列/某行的分位数；

4.1.4 相关性运算

In [ ]:
相关性常用来衡量两个事物之间的相关程度，我们一般用相关系数来衡量两者的相关程度，比较常用的是皮尔逊相关系数
excel中用correl(A1:A10,B1:B10)---计算A列与B列的相关系数
mysql中没有可以直接使用的函数；
python中df.corr()计算表中各列两两之间的相关系数；df['col1'].corr(df['col2'])计算col1与col2列的相关系数

In [14]:
df4['a'].corr(df4['b'])

1.0

In [15]:
df4.corr()

     a    b    c
a  1.0  1.0  1.0
b  1.0  1.0  1.0
c  1.0  1.0  1.0

4.1.5 本关作业

In [16]:
#1、df表中col1列和col2列相乘应该怎么写?
df4['a']*df4['b']

0     4
1    10
2    18
3    28
dtype: int64

In [17]:
#2、判断df表中col1列中每个值是否大于col2列？
df4['a']>df4['b']

0    False
1    False
2    False
3    False
dtype: bool

In [18]:
#3、对df表中每一列进行非空计数
df4.count()

a    4
b    4
c    4
dtype: int64

In [19]:
#4、求df表中col1列的和？
df4['a'].sum()

10

In [21]:
#5、求df表中col1和col2列的相关系数？
df4['a'].corr(df4['b'])

1.0

# 4.2 时间序列

## 4.2.1 获取当前时刻的时间

excel中用now()实现；
mysql中也用now()函数实现--select now()；
python中也用now()函数

In [2]:
#1、返回当前时刻的日期和时间
from datetime import datetime
datetime.now()

datetime.datetime(2019, 6, 19, 14, 41, 17, 997087)

#2、返回当前时刻的年、月、日、日期、时间
excel中和mysql中都用year(now())   month(now())   day(now())
mysql日期函数大全https://www.jb51.net/article/135803.htm
python中用datetime.now().year   datetime.now().month   datetime.now().day     datetime.now().date()   datetime.now().time()

In [11]:
datetime.now().day

19

In [10]:
datetime.now().date()

datetime.date(2019, 6, 19)

#3、返回当前时刻的周数
#返回周几
excel中用weekday(now()-1)---减1是因为Excel把周日作为一周中的第一天
mysql中DAYOFWEEK(date)--返回日期date是星期几(1=星期天,2=星期一,……7=星期六,ODBC标准)；WEEKDAY(date) ---返回日期date是星期几(0=星期一,1=星期二,……6= 星期天)。 
python中用datetime.now().weekday()+1 ---加1是因为周一返回0，周日返回6

In [4]:
datetime.now().weekday()+1

3

#返回周数
excel中用weeknum()函数
mysql中WEEK(date,first)---返回date是一年的第几周(first默认值0,first取值1表示周一是周的开始,0从周日开始)
python中用datetime.now().isocalendar()---默认周一是周的开始

In [5]:
datetime.now().isocalendar()

(2019, 25, 3)

In [8]:
datetime.now().isocalendar()[1]  #表示取返回值的第2个元素

25

In [2]:
#获取一个df表时间列的小时数
import pandas as pd
data=pd.read_csv(r'/Users/Eric/Documents/2019/learning/1_python/对比Excel,轻松学习Python数据分析数据集/order-14.1.csv',
                 encoding="gbk",sep= ",")
data_notnull=data.dropna(how='all')   #删除所有的空白行
#要用到时间，因此要将成交时间的类型变成日期型
data_notnull['成交时间']=data_notnull['成交时间'].astype('datetime64')
data_notnull['商品ID']=data_notnull['商品ID'].astype('str')
data_notnull['类别ID']=data_notnull['类别ID'].astype('str')
data_notnull['订单ID']=data_notnull['订单ID'].astype('str')
data_notnull.head(5)

/usr/local/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  import sys
/usr/local/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

/usr/local/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  if __name__ == '__main__':
/usr/local/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:10: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  # Remove the CWD from sys.path while we load stuff.

,商品ID,类别ID,门店编号,单价,销量,成交时间,订单ID
0,30006206.0,915000003.0,CDNL,25.23,0.328,2018-01-01,20170103CDLG000210052759
1,30163281.0,914010000.0,CDNL,2.00,2.000,2018-01-02,20170103CDLG000210052759
2,30200518.0,922000000.0,CDNL,19.62,0.230,2018-01-03,20170103CDLG000210052759
3,29989105.0,922000000.0,CDNL,2.80,2.044,2018-01-04,20170103CDLG000210052759
4,30179558.0,915000100.0,CDNL,47.41,0.226,2018-01-05,20170103CDLG000210052759

In [3]:
#创建时段指标---自定义一个提取小时的函数，并应用于每一个值
from datetime import datetime
data_notnull['时段']=data_notnull['成交时间'].map(lambda x:int(x.strftime('%H')))
data_notnull.head(5)

/usr/local/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  This is separate from the ipykernel package so we can avoid doing imports until

,商品ID,类别ID,门店编号,单价,销量,成交时间,订单ID,时段
0,30006206.0,915000003.0,CDNL,25.23,0.328,2018-01-01,20170103CDLG000210052759,0
1,30163281.0,914010000.0,CDNL,2.00,2.000,2018-01-02,20170103CDLG000210052759,0
2,30200518.0,922000000.0,CDNL,19.62,0.230,2018-01-03,20170103CDLG000210052759,0
3,29989105.0,922000000.0,CDNL,2.80,2.044,2018-01-04,20170103CDLG000210052759,0
4,30179558.0,915000100.0,CDNL,47.41,0.226,2018-01-05,20170103CDLG000210052759,0

## 4.2.2 指定日期和时间的格式

excel中要用设置单元格格式；
mysql中DATE_FORMAT(date，format)：根据参数对date进行格式化。https://www.jb51.net/article/135803.htm
python中用strftime()函数自定义时间和日期的格式，该格式与mysql中DATE_FORMAT很像

In [12]:
datetime.now().strftime('%Y-%m-%d %H:%M:%S')

'2019-06-19 15:29:58'

## 4.2.3 字符串和时间格式相互转换

1、将时间格式转换为字符串格式

excel中使用设置单元格格式；
mysql中用DATE_FORMAT(日期，格式字符串) ---SELECT DATE_FORMAT(NOW(), '%Y-%m-%d %H:%i:%s');
cast(a.consume_date as char(10)) as consume_date，CAST函数语法规则是：cast(字段名 as 转换的类型）
python中用str([字段])

In [13]:
now=datetime.now()

In [14]:
type(now)

datetime.datetime

In [15]:
str(now)

'2019-06-19 16:09:36.644294'

In [16]:
type(str(now))

str

2、将字符串格式转换为时间格式

excel中使用设置单元格格式；
mysql中用STR_TO_DATE(字符串，日志格式)---SELECT STR_TO_DATE('2019-01-20 16:01:45', '%Y-%m-%d %H:%i:%s');
python中用parse()函数,parse是解析的意思。

In [17]:
str_time='2018-10-14'
type(str_time)

str

In [19]:
from dateutil.parser import parse
parse(str_time) #将字符串解析为时间

datetime.datetime(2018, 10, 14, 0, 0)

## 4.2.4 时间索引

时间索引就是根据时间对时间格式的字段进行数据选取的一种索引方式。
excel中有专门针对日期格式的日期筛选；
sql中创建索引要考虑数据库的性能；
python中通过索引可以选取具体的某一时间的值，也可以选取某一段时间内的值

In [74]:
#新建一个时间索引的df表
import pandas as pd
import numpy as np
time_index = pd.DatetimeIndex(['2017-12-30','2018-01-02','2018-01-03','2018-01-04','2018-02-05','2018-02-06','2018-03-07','2018-03-08'])
data=pd.DataFrame(np.arange(1,9),columns=['num'],index=time_index)
data

            num
2017-12-30    1
2018-01-02    2
2018-01-03    3
2018-01-04    4
2018-02-05    5
2018-02-06    6
2018-03-07    7
2018-03-08    8

In [75]:
#获取2018年数据
data['2018']  #mysql中可以用left(日期，4)处理后用在where语句里

            num
2018-01-02    2
2018-01-03    3
2018-01-04    4
2018-02-05    5
2018-02-06    6
2018-03-07    7
2018-03-08    8

In [76]:
#获取2018年1月数据
data['2018-01']  #mysql中可以用left(日期，7)处理后用在where语句里

            num
2018-01-02    2
2018-01-03    3
2018-01-04    4

In [77]:
#获取2018年1月1日到1月3日数据
data['2018-01-01':'2018-01-03']  #mysql中可以用left(日期，10)处理后用在where语句里

            num
2018-01-02    2
2018-01-03    3

In [78]:
#获取2018年1月2日数据
data['2018-01-02':'2018-01-02']  #注意不是data['2018-01-02']

            num
2018-01-02    2

上面的索引方法适用于索引是时间的情况下，但是通常一个订单表的索引是用户ID或订单ID，时间只是一个普通列，时间是有大小关系的，这个时候选择时间可以利用布尔索引

In [80]:
df_time=pd.DataFrame([['1001',10,'2018-01-01'],['1002',20,'2018-01-02'],['1003',30,'2018-02-01'],['1004',40,'2018-03-01']],
                    columns=['用户id','收入','时间'])

In [81]:
df_time['时间']=df_time['时间'].astype('datetime64')

In [82]:
df_time.set_index('用户id')

      收入         时间
用户id
1001  10 2018-01-01
1002  20 2018-01-02
1003  30 2018-02-01
1004  40 2018-03-01

In [51]:
df_time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
用户id    4 non-null object
收入      4 non-null int64
时间      4 non-null datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 176.0+ bytes

In [52]:
#选取时间为2018-01-01的订单
df_time[df_time['时间']==datetime(2018,1,1)]

   用户id  收入         时间
0  1001  10 2018-01-01

In [53]:
#选取成交时间在2018-02-01之后的订单
df_time[df_time['时间'] > datetime(2018,2,1)]

   用户id  收入         时间
3  1004  40 2018-03-01

In [56]:
#选取成交时间在2018-01-01到2018-02-01之间的订单
df_time[(df_time['时间'] >= datetime(2018,1,1))&(df_time['时间'] < datetime(2018,2,1))]

   用户id  收入         时间
0  1001  10 2018-01-01
1  1002  20 2018-01-02

4.2.5 时间运算

1、两个时间之差

excel中用=DATEDIF(A1,A2,"y/m/d")，y-年,m-月,d-天;
sql中 datediff(date1,date2), timediff(time1,time2)
SELECT TIMESTAMPDIFF(interval,'2009-10-01','2009-09-01'); 
interval可是： 
SECOND 秒 SECONDS 
MINUTE 分钟 MINUTES 
HOUR 时间 HOURS 
DAY 天 DAYS 
MONTH 月 MONTHS 
YEAR 年 YEARS
python中只有现成函数返回两日期差的天/时/秒，需要写自定义函数来返回两日期差的年/月/天

In [83]:
from datetime import datetime

In [84]:
date_a=datetime(2018,1,30,18,20)
date_a1=datetime(2018,1,30)
date_b=datetime(2018,2,1,10,15)
date_b1=datetime(2018,2,1)
cha=date_b-date_a
cha1=date_b1-date_a1

In [85]:
cha.days #返回两日期差的天数 ,跟日期的时间粒度有关系，到天、时、秒

1

In [86]:
cha1.days

2

In [29]:
cha.seconds #返回两日期差的秒

57300

In [30]:
cha.seconds/3600 #返回两日期差的小时

15.916666666666666

In [31]:
def days(str1,str2):
    date_1=datetime.strptime(str1[0:10],"%Y-%m-%d")
    date_2=datetime.strptime(str2[0:10],"%Y-%m-%d")
    num=(date_2-date_1).days
    return num

In [43]:
def months(str1,str2):
    year1=datetime.strptime(str1[0:10],"%Y-%m-%d").year
    year2=datetime.strptime(str2[0:10],"%Y-%m-%d").year
    month1=datetime.strptime(str1[0:10],"%Y-%m-%d").month
    month2=datetime.strptime(str2[0:10],"%Y-%m-%d").month
    num=(year2-year1)*12+(month2-month1)
    return num

In [44]:
days('2018-01-30 18:20:00','2018-02-01 10:15:00')

2

In [45]:
months('2018-01-30 18:20:00','2018-02-01 10:15:00')

1

2、时间偏移

时间偏移是指给时间往前推或往后推一段时间，即加或减一段时间

excel中的运算单位是天，若是偏移小时或分钟需要换算成对应的天，因此比较麻烦，这里不做介绍；
sql中select date_add(@dt, interval 1 day/month等)；select date_sub(@dt, interval 1 day/month等);
python中有两种方式，第一种是借助timedelta，但是它只能偏移天、秒、微秒单位的时间；第二种是用pandas中的日期偏移量date offset，可以直接实现天、小时、分钟单位的时间偏移，会更方便

1)第一种是借助timedelta

In [46]:
from datetime import timedelta

In [47]:
date=datetime(2018,5,18,20,32)

In [48]:
date+timedelta(days=1)  #往后推1天

datetime.datetime(2018, 5, 19, 20, 32)

In [49]:
date-timedelta(days=1)  #往前推1天

datetime.datetime(2018, 5, 17, 20, 32)

In [50]:
date+timedelta(seconds=60)  #往后推60s

datetime.datetime(2018, 5, 18, 20, 33)

In [51]:
date-timedelta(seconds=60)  #往前推60s

datetime.datetime(2018, 5, 18, 20, 31)

2）第二种是用pandas中的日期偏移量date offset

In [52]:
from pandas.tseries.offsets import Day,Hour,Minute

In [53]:
date+Day(1) #往后推1天

Timestamp('2018-05-19 20:32:00')

In [54]:
date-Hour(1) #往前推1小时

Timestamp('2018-05-18 19:32:00')

In [55]:
date+Minute(10) #往后推10分钟

Timestamp('2018-05-18 20:42:00')

4.2.6 本关作业

1、利用datetime模块获取当前时刻的时间，并分别获取具体的年、月、日、周几、周数？

In [56]:
from datetime import datetime
datetime.now()

datetime.datetime(2019, 6, 20, 14, 37, 9, 483116)

In [57]:
datetime.now().year

2019

In [58]:
datetime.now().month

6

In [59]:
datetime.now().date

In [64]:
datetime.now().weekday()+1

4

In [66]:
datetime.now().isocalendar()[1]

25

2、字符串与时间相互转换用到datetime模块中的哪个函数？---str()与parse()

In [67]:
str(datetime.now())

'2019-06-20 15:02:58.113793'

from dateutil.parser import parse
parse('2019-01-01')

3、如果某一时间列是表df的索引，获取2017年所有数据怎么写？获取2017年10月数据怎么写？---df['2017']    df[2017-01']

4、如果某一时间列是普通列，获取2018-01-01之后的数据怎么写？---df[df['时间']>datetime(2018,1,1)]

5、将当前时间向前推3天，向后推12小时怎么写？

In [90]:
from pandas.tseries.offsets import Day,Hour,Minute

In [91]:
datetime.now()-Day(3)

Timestamp('2019-06-17 15:17:54.674940')

# 4.3 数据分组与透视表

## 4.3.1 数据分组

excel中先排序然后再使用分类汇总功能,进行求和、计数、平均值、最大值、最小值、乘积、偏差、方差；
sql中用group by语句；
python中也是用groupby()方法

1、分组键是列名

直接将某一列或多列的列名传递给groupby()方法

In [98]:
#1）按照一列进行分组
import pandas as pd
df_group=pd.DataFrame({'ID':['1001','1002','1003','1004','1005'],
                       '分类':['a','b','c','a','b'],
                       '区域':['一线','三线','二线','一线','三线'],
                      '销量':[1000,2000,3000,1500,2500]})
df_group

     ID 分类  区域    销量
0  1001  a  一线  1000
1  1002  b  三线  2000
2  1003  c  二线  3000
3  1004  a  一线  1500
4  1005  b  三线  2500

In [99]:
df_group.groupby('分类')
#运行之后返回的是一个DataFrameGroupBy对象，这个对象里面包含着分组后的若干数组，不会直接显示出来，需要进行汇总计算才会显示

In [100]:
#分组后计数运算，每一列都会有结果
df_group.groupby('分类').count()

    ID  区域  销量
分类
a    2   2   2
b    2   2   2
c    1   1   1

In [101]:
#分组后求和运算，只有数值列才有结果
df_group.groupby('分类').sum()

      销量
分类
a   2500
b   4500
c   3000

In [102]:
#2）按照多列进行分组
df_group.groupby(['分类','区域']).count()

       ID  销量
分类 区域
a  一线   2   2
b  三线   2   2
c  二线   1   1

In [103]:
df_group.groupby(['分类','区域']).sum()

         销量
分类 区域
a  一线  2500
b  三线  4500
c  二线  3000

In [104]:
#3)指定列计算
df_group.groupby(['分类','区域'])['ID'].count()

分类  区域
a   一线    2
b   三线    2
c   二线    1
Name: ID, dtype: int64

2、分组键是series

把DateFrame的其中一列取出来就是一个Series

In [105]:
#1）按照一个Series分组
df_group.groupby(df_group['分类']).count()

    ID  区域  销量
分类
a    2   2   2
b    2   2   2
c    1   1   1

In [106]:
#2)按照多个Series分组
df_group.groupby([df_group['分类'],df_group['区域']]).count()

       ID  销量
分类 区域
a  一线   2   2
b  三线   2   2
c  二线   1   1

3、神奇的aggregate()方法

前面的方法分组的列做的都是同一种汇总运算，且一次只能使用一种汇总方式；aggregate()方法的第一个神奇之处就是一次可以使用多种汇总方式。

In [107]:
df_group.groupby('分类').aggregate(['count','sum'])

      ID              区域          销量
   count       sum count   sum count   sum
分类
a      2  10011004     2  一线一线     2  2500
b      2  10021005     2  三线三线     2  4500
c      1      1003     1    二线     1  3000

In [108]:
df_group.groupby('分类')['销量'].aggregate(['count','sum'])

    count   sum
分类
a       2  2500
b       2  4500
c       1  3000

aggregate()方法的第二个神奇之处是可以针对不同的列做不同的汇总计算

In [109]:
df_group.groupby('分类').aggregate({'ID':'count','销量':'sum'})

    ID    销量
分类
a    2  2500
b    2  4500
c    1  3000

4、对分组后的结果重置索引

为了把分组后的DataFrameGroupBy对象转化为标准的DataFrame形式便于进一步的处理和分析，就需要用到reset_index()方法

In [110]:
df_group.groupby('分类').sum().reset_index()

  分类    销量
0  a  2500
1  b  4500
2  c  3000

## 4.3.2 数据透视表

数据分组是在一个维度上对数据进行分组，数据透视表是从行列两个维度上同时对数据进行分组

excel中数据透视表是其强大的数据统计分析功能之一；
sql中也可实现
select name,
sum(case sex when "female" then tizhong else 0 end) as female ,
sum(case when sex="male" then tizhong else 0 end) as male,
sum(case when sex="unknown" then tizhong else 0 end) as unknown
from x 
GROUP BY name;
原文：https://blog.csdn.net/kevin_7july/article/details/80301509 

python中用pivot_table()方法，
pandas.pivot_table(data, values=None, index=None, columns=None, aggfunc='mean', fill_value=None, margins=False, dropna=True, margins_name='All')[source]
data-表示要做数据透视表的整个表
values-对应Excel数据透视表值那个框，表示对什么值做汇总计算
index-对应Excel数据透视表行那个框，表示纵轴汇总依据
columns-对应Excel数据透视表列那个框，表示横轴汇总依据
aggfunc-表示要做什么类型的汇总计算
fill_value-表示展示的NaN缺失值进行填充
margins-表示是否显示合计列，默认False即不显示
dropna-表示是否删除缺失行，默认为真，即把一整行全作为缺失值删除
margins_name-表示合计列的列名

In [124]:
import numpy as np
df_pivot=pd.DataFrame({'ID':['1001','1002','1003','1004','1005','1006'],
                       '分类':['a','b','c','a','b','a'],
                       '区域':['一线','三线','二线','一线','三线',np.nan],
                      '销量':[1000,2000,3000,1500,2500,np.nan]})
df_pivot

     ID 分类   区域      销量
0  1001  a   一线  1000.0
1  1002  b   三线  2000.0
2  1003  c   二线  3000.0
3  1004  a   一线  1500.0
4  1005  b   三线  2500.0
5  1006  a  NaN     NaN

In [125]:
pd.pivot_table(df_pivot,values='ID',index='分类',columns='区域',aggfunc='count',margins=True)

区域    一线   三线   二线  All
分类
a    2.0  NaN  NaN    2
b    NaN  2.0  NaN    2
c    NaN  NaN  1.0    1
All  2.0  2.0  1.0    5

In [126]:
pd.pivot_table(df_pivot,values='ID',index='分类',columns='区域',aggfunc='count',dropna=False)

区域   一线   三线   二线
分类
a   2.0  NaN  NaN
b   NaN  2.0  NaN
c   NaN  NaN  1.0

In [127]:
#对展示的NaN缺失值进行填充
pd.pivot_table(df_pivot,values='ID',index='分类',columns='区域',aggfunc='count',margins=True,fill_value=0)

区域   一线  三线  二线  All
分类
a     2   0   0    2
b     0   2   0    2
c     0   0   1    1
All   2   2   1    5

#aggfunc只传人一种计算类型时，会对所有值字段都进行同样的计算；如果需要对不同的值进行不同的计算，需要传人一个字典，其中键为列名，值为计算方式

In [128]:
pd.pivot_table(df_pivot,values=['ID','销量'],index='分类',columns='区域',aggfunc={'ID':'count','销量':'sum'},margins=True,fill_value=0)

    ID              销量
区域  一线 三线 二线 All    一线    三线    二线      All
分类
a    2  0  0   2  2500     0     0   2500.0
b    0  2  0   2     0  4500     0   4500.0
c    0  0  1   1     0     0  3000   3000.0
All  2  2  1   5  2500  4500  3000  10000.0

In [129]:
#为了便于后期分析与处理，我们一般会对数据透视表的结果重置索引，用reset_index()方法
pd.pivot_table(df_pivot,values=['ID','销量'],index='分类',columns='区域',aggfunc={'ID':'count','销量':'sum'},margins=True,fill_value=0).reset_index()

     分类 ID              销量
区域      一线 三线 二线 All    一线    三线    二线      All
0     a  2  0  0   2  2500     0     0   2500.0
1     b  0  2  0   2     0  4500     0   4500.0
2     c  0  0  1   1     0     0  3000   3000.0
3   All  2  2  1   5  2500  4500  3000  10000.0

## 4.3.3 本关作业

1、将df表按照col1列进行分组并进行计数汇总运算，怎么写？
df.groupby('col1').count()

2、将df表按照col1列进行分组并进行求和汇总运算，对结果进行重置索引，怎么写？
df.groupby('col1').sum().reset_index()

3、对df表做数据透视表，col1列做index,col2列做columns,col3列做value,其中缺失值填充为0，对value做求和运算，怎么写？
pd.pivot_table(df,index='col1',columns='col2',value='col3',fill_value=0,aggfunc='sum')

# 4.4 多表拼接

## 4.4.1 表的横向拼接

表的横向拼接，就是横向将两个表依据公共列拼接在一起，拼接之后列数增加；
excel中是用vlookup()函数实现；
mysql中是用inner join,left join,right join实现
python中是用pd.merge(df1,df2)实现

1、连接方式

In [1]:
#一对一连接---指待连接的两个表的公共列是一对一的
import pandas as pd
df1=pd.DataFrame([[1,'小张','1000',650],[2,'小王','1001',600],[3,'小李','1002',578],[4,'小赵','1003',550]],columns=['名次','姓名','学号','成绩'])
df1

   名次  姓名    学号   成绩
0   1  小张  1000  650
1   2  小王  1001  600
2   3  小李  1002  578
3   4  小赵  1003  550

In [2]:
df2=pd.DataFrame([['1001','小王','1班'],['1002','小李','1班'],['1003','小赵','2班'],['1004','小黄','3班']],columns=['学号','姓名','班级'])
df2

     学号  姓名  班级
0  1001  小王  1班
1  1002  小李  1班
2  1003  小赵  2班
3  1004  小黄  3班

In [160]:
pd.merge(df1,df2)

   名次  姓名    学号   成绩  班级
0   2  小王  1001  600  1班
1   3  小李  1002  578  1班
2   4  小赵  1003  550  2班

In [161]:
#多对一---待连接的两个表的公共列不是一对一，而是多对一，即其中一个表的公共列有重复
df3=pd.DataFrame([['1001',90],['1001',95],['1002',88],['1002',99]],columns=['学号','科目成绩'])
df3

     学号  科目成绩
0  1001    90
1  1001    95
2  1002    88
3  1002    99

In [162]:
pd.merge(df1,df3,on='学号')
#默认inner join

   名次  姓名    学号   成绩  科目成绩
0   2  小王  1001  600    90
1   2  小王  1001  600    95
2   3  小李  1002  578    88
3   3  小李  1002  578    99

In [163]:
#多对多---待连接的两个表的公共列都不是一对一的，即两个表中的公共列都有重复值
df4=pd.DataFrame([[1,'小张','1001',650],[2,'小张','1001',600],[3,'小李','1002',578],[4,'小赵','1003',550]],columns=['名次','姓名','学号','成绩'])
df4

   名次  姓名    学号   成绩
0   1  小张  1001  650
1   2  小张  1001  600
2   3  小李  1002  578
3   4  小赵  1003  550

In [164]:
pd.merge(df4,df3)
#默认是inner join

   名次  姓名    学号   成绩  科目成绩
0   1  小张  1001  650    90
1   1  小张  1001  650    95
2   2  小张  1001  600    90
3   2  小张  1001  600    95
4   3  小李  1002  578    88
5   3  小李  1002  578    99

#上面的例子中，如果没有指定按哪个列进行拼接，会默认按公共列作为连接键；也可以用参数on来指定连接列；公共列也可以有多列；

In [165]:
#当两个表中没有公共列，这里指实际值一样但是列名不一样，这个时候就要分别指定左表和右表的连接键，使用的参数是left_on和right_on
df22=pd.DataFrame([['1001','1班'],['1002','1班'],['1003','2班'],['1004','3班']],columns=['编号','班级'])
df22

     编号  班级
0  1001  1班
1  1002  1班
2  1003  2班
3  1004  3班

In [166]:
df22.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
编号    4 non-null object
班级    4 non-null object
dtypes: object(2)
memory usage: 144.0+ bytes

In [167]:
pd.merge(df1,df22,left_on='学号',right_on='编号')

   名次  姓名    学号   成绩    编号  班级
0   2  小王  1001  600  1001  1班
1   3  小李  1002  578  1002  1班
2   4  小赵  1003  550  1003  2班

In [168]:
#把索引列当作连接键，索引列不算事真正的列，当公共列是索引列，就要把索引列当作连接键，需要用到参数left_index和right_index)
df1_index=df1.set_index('学号')
df1_index

      名次  姓名   成绩
学号
1000   1  小张  650
1001   2  小王  600
1002   3  小李  578
1003   4  小赵  550

In [169]:
df1_index.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 1000 to 1003
Data columns (total 3 columns):
名次    4 non-null int64
姓名    4 non-null object
成绩    4 non-null int64
dtypes: int64(2), object(1)
memory usage: 128.0+ bytes

In [170]:
pd.merge(df1_index,df22,left_index=True,right_on='编号')

   名次  姓名   成绩    编号  班级
0   2  小王  600  1001  1班
1   3  小李  578  1002  1班
2   4  小赵  550  1003  2班

#之前的情况是左右表可以互相找到公共列，但是现实业务中很多时候互相找不到，这就需要how参数来指明具体的连接方式

In [176]:
#1）内连接---取两个表中公共部分
pd.merge(df1,df2,on='学号',how='inner')

   名次 姓名_x    学号   成绩 姓名_y  班级
0   2   小王  1001  600   小王  1班
1   3   小李  1002  578   小李  1班
2   4   小赵  1003  550   小赵  2班

In [177]:
#左连接---以左表为基础
pd.merge(df1,df2,on='学号',how='left')

   名次 姓名_x    学号   成绩 姓名_y   班级
0   1   小张  1000  650  NaN  NaN
1   2   小王  1001  600   小王   1班
2   3   小李  1002  578   小李   1班
3   4   小赵  1003  550   小赵   2班

In [178]:
#右连接---以右表为基础
pd.merge(df1,df2,on='学号',how='right')

    名次 姓名_x    学号     成绩 姓名_y  班级
0  2.0   小王  1001  600.0   小王  1班
1  3.0   小李  1002  578.0   小李  1班
2  4.0   小赵  1003  550.0   小赵  2班
3  NaN  NaN  1004    NaN   小黄  3班

In [179]:
#外连接---取两个表的并集
pd.merge(df1,df2,on='学号',how='outer')

    名次 姓名_x    学号     成绩 姓名_y   班级
0  1.0   小张  1000  650.0  NaN  NaN
1  2.0   小王  1001  600.0   小王   1班
2  3.0   小李  1002  578.0   小李   1班
3  4.0   小赵  1003  550.0   小赵   2班
4  NaN  NaN  1004    NaN   小黄   3班

2、重复列名处理

In [180]:
pd.merge(df1,df2,on='学号',how='inner',suffixes=['_df1','_df2'])

   名次 姓名_df1    学号   成绩 姓名_df2  班级
0   2     小王  1001  600     小王  1班
1   3     小李  1002  578     小李  1班
2   4     小赵  1003  550     小赵  2班

## 4.4.2 表的纵向拼接

1、普通合并

In [3]:
pd.concat([df1,df2])

/usr/local/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

    名次  姓名    学号     成绩   班级
0  1.0  小张  1000  650.0  NaN
1  2.0  小王  1001  600.0  NaN
2  3.0  小李  1002  578.0  NaN
3  4.0  小赵  1003  550.0  NaN
0  NaN  小王  1001    NaN   1班
1  NaN  小李  1002    NaN   1班
2  NaN  小赵  1003    NaN   2班
3  NaN  小黄  1004    NaN   3班

In [5]:
#设置索引
pd.concat([df1.set_index("学号"),df2.set_index("学号")],ignore_index = True)

/usr/local/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

    名次  姓名     成绩   班级
0  1.0  小张  650.0  NaN
1  2.0  小王  600.0  NaN
2  3.0  小李  578.0  NaN
3  4.0  小赵  550.0  NaN
4  NaN  小王    NaN   1班
5  NaN  小李    NaN   1班
6  NaN  小赵    NaN   2班
7  NaN  小黄    NaN   3班

In [6]:
#去掉重复数据
pd.concat([df1,df2],ignore_index = True).drop_duplicates()

/usr/local/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

    名次  姓名    学号     成绩   班级
0  1.0  小张  1000  650.0  NaN
1  2.0  小王  1001  600.0  NaN
2  3.0  小李  1002  578.0  NaN
3  4.0  小赵  1003  550.0  NaN
4  NaN  小王  1001    NaN   1班
5  NaN  小李  1002    NaN   1班
6  NaN  小赵  1003    NaN   2班
7  NaN  小黄  1004    NaN   3班

# 4.5 结果导出

## 4.5.1 导出.xlsx文件

In [7]:
#设置文件导出路径
import pandas as pd
df1.to_excel(excel_writer = r"/Users/Eric/Documents/2019/python/测试文档01.xlsx")

In [ ]:
#设置Sheet名称
df.to_excel(excel_writer = r"C:\Users\Administrator\Excel-Python\Data\测试文档02.xlsx",
            sheet_name ="测试")

In [ ]:
#设置索引
df.to_excel(excel_writer = r"C:\Users\Administrator\Excel-Python\Data\测试文档03.xlsx",
            index = False)

In [ ]:
#设置要导出的列
df = pd.read_excel(r"../Data/Chapter12.xlsx",sheet_name =0 )
df.to_excel(excel_writer = r"C:\Users\Administrator\Excel-Python\Data\测试文档04.xlsx",
            sheet_name = "测试文档",
            index=False,columns = ["用户ID","7月销量","8月销量","9月销量"])

In [ ]:
#设置编码格式
df.to_excel(excel_writer = r"C:\Users\Administrator\Excel-Python\Data\测试文档05.xlsx",
           sheet_name = "测试文档",
           index = False,
           encoding = "utf-8")

In [ ]:
#缺失值处理
df = pd.read_excel(r"../Data/Chapter12.xlsx",sheet_name =2)
df.to_excel(excel_writer = r"C:\Users\Administrator\Excel-Python\Data\测试文档06.xlsx",
           sheet_name="测试文档",
           index = False,
           encoding = "utf-8",
           na_rep = 0 #缺失值填充为0
           )

In [ ]:
#无穷值处理
df = pd.read_excel(r"../Data/Chapter12.xlsx",sheet_name =1)
df.to_excel(excel_writer = r"C:\Users\Administrator\Excel-Python\Data\测试文档07.xlsx",
           sheet_name = "测试文档",
           index = False,
           encoding = "utf-8",
           na_rep = 0,
           inf_rep = 0 #无穷值填充为0
           )

## 4.5.2 导出为 .csv文件

In [ ]:
#设置文件导出路径
df = pd.read_excel(r"../Data/Chapter12.xlsx",sheet_name =0)
df.to_csv(path_or_buf = r"C:\Users\Administrator\Excel-Python\Data\测试文档01.csv" )

In [ ]:
#设置索引
df.to_csv(path_or_buf = r"C:\Users\Administrator\Excel-Python\Data\测试文档02.csv",
          index = False )

In [ ]:
#设置导出的列
df.to_csv(path_or_buf = r"C:\Users\Administrator\Excel-Python\Data\测试文档03.csv" ,
          index= False,
          columns = ["用户ID","7月销量","8月销量","9月销量"])

In [ ]:
#设置分隔符号
df.to_csv(path_or_buf = r"C:\Users\Administrator\Excel-Python\Data\测试文档04.csv" ,
          index= False,
          columns = ["用户ID","7月销量","8月销量","9月销量"],
          sep=",")

In [ ]:
#缺失值处理
df = pd.read_excel(r"../Data/Chapter12.xlsx",sheet_name =2)
df.to_csv(path_or_buf = r"C:\Users\Administrator\Excel-Python\Data\测试文档05.csv" ,
          index= False,
          columns = ["用户ID","7月销量","8月销量","9月销量"],
          sep=",",
          na_rep = 0)

In [ ]:
#设置编码格式
df = pd.read_excel(r"../Data/Chapter12.xlsx",sheet_name =2)
df.to_csv(path_or_buf = r"C:\Users\Administrator\Excel-Python\Data\测试文档06.csv" ,
          index= False,
          columns = ["用户ID","7月销量","8月销量","9月销量"],
          sep=",",
          na_rep = 0,
          encoding = "gbk" #设置为gbk或者utf-8-sig
         )

## 4.5.3 将文件导出到多个Sheet

In [ ]:
df1 = pd.read_excel(r"../Data/Chapter12.xlsx",sheet_name =0)
df2 = pd.read_excel(r"../Data/Chapter12.xlsx",sheet_name =1)
df3 = pd.read_excel(r"../Data/Chapter12.xlsx",sheet_name =2)
#声明一个对象
writer = pd.ExcelWriter(r"C:\Users\Administrator\Excel-Python\Data\test02.xlsx",
                        engine = "xlsxwriter")
#将df1、df2、df3写入Excel中的sheet1、sheet2、sheet3
#重命名表1、表2、表3
df1.to_excel(writer,sheet_name ="表1")
df2.to_excel(writer,sheet_name ="表2")
df3.to_excel(writer,sheet_name ="表3")
#保存读写的内容
writer.save()